Revit 2024 API
CircleLightShape Constructor
 Creates a circle light shape object with 2.0' emit diameter.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CircleLightShape()
Visual Basic
Public Sub New
Visual C++
public:
CircleLightShape()
See Also
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace